; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v6 ?v3)
		(pred_2 ?v2)
		(pred_6 ?v8)
		(pred_3 ?v8)
		(pred_5 ?v2 ?v8)
		(pred_4)
		(pred_1 ?v2))

   (:action op_3
       :parameters  (?v5 ?v4)
       :precondition (and (not-eq ?v5 ?v4) 
                          (pred_6 ?v5) (pred_6 ?v4) (pred_3 ?v5))
       :effect (and  (pred_3 ?v4)
		     (not (pred_3 ?v5))))


   (:action op_2
       :parameters (?v1 ?v7)
       :precondition  (and  (pred_2 ?v1) (pred_6 ?v7)
			    (pred_5 ?v1 ?v7) (pred_3 ?v7) (pred_4))
       :effect (and (pred_1 ?v1)
		    (not (pred_5 ?v1 ?v7)) 
		    (not (pred_4))))

   (:action op_1
       :parameters  (?v1  ?v7)
       :precondition  (and  (pred_2 ?v1) (pred_6 ?v7)
			    (pred_1 ?v1) (pred_3 ?v7))
       :effect (and (pred_5 ?v1 ?v7)
		    (pred_4)
		    (not (pred_1 ?v1)))))

; problem
(define (problem ferry-l6-c2)
(:domain ferry)
(:objects obj_03 obj_07 obj_04 obj_02 obj_01 obj_08 
          obj_06 obj_05 
)
(:init
(pred_6 obj_03)
(pred_6 obj_07)
(pred_6 obj_04)
(pred_6 obj_02)
(pred_6 obj_01)
(pred_6 obj_08)
(pred_2 obj_06)
(pred_2 obj_05)
(not-eq obj_03 obj_07)
(not-eq obj_07 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_02)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_08)
(not-eq obj_08 obj_03)
(not-eq obj_07 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_02)
(not-eq obj_02 obj_07)
(not-eq obj_07 obj_01)
(not-eq obj_01 obj_07)
(not-eq obj_07 obj_08)
(not-eq obj_08 obj_07)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_08)
(not-eq obj_08 obj_04)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_08)
(not-eq obj_08 obj_02)
(not-eq obj_01 obj_08)
(not-eq obj_08 obj_01)
(pred_4)
(pred_5 obj_06 obj_01)
(pred_5 obj_05 obj_07)
(pred_3 obj_04)
)
(:goal
(and
(pred_5 obj_06 obj_03)
(pred_5 obj_05 obj_08)
)
)

(:constraints
  (and
    (sometime-before  (pred_5 obj_06 obj_03) (pred_3 obj_07))
    (sometime-before  (pred_5 obj_05 obj_08) (pred_3 obj_03))
  )
)
)

; plan
1. (op_3 obj_04 obj_07)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_07)
   goals met: 0 of 2
2. (op_2 obj_05 obj_07)
   deleted: (pred_5 obj_05 obj_07) (pred_4)
   added: (pred_1 obj_05)
   goals met: 0 of 2
3. (op_3 obj_07 obj_01)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_01)
   goals met: 0 of 2
4. (op_1 obj_05 obj_01)
   deleted: (pred_1 obj_05)
   added: (pred_5 obj_05 obj_01) (pred_4)
   goals met: 0 of 2
5. (op_2 obj_06 obj_01)
   deleted: (pred_5 obj_06 obj_01) (pred_4)
   added: (pred_1 obj_06)
   goals met: 0 of 2
6. (op_3 obj_01 obj_03)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_03)
   goals met: 0 of 2
7. (op_1 obj_06 obj_03)
   deleted: (pred_1 obj_06)
   added: (pred_5 obj_06 obj_03) (pred_4)
   goals met: 1 of 2
8. (op_3 obj_03 obj_01)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_01)
   goals met: 1 of 2
9. (op_2 obj_05 obj_01)
   deleted: (pred_5 obj_05 obj_01) (pred_4)
   added: (pred_1 obj_05)
   goals met: 1 of 2
10. (op_3 obj_01 obj_08)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_08)
   goals met: 1 of 2
11. (op_1 obj_05 obj_08)
   deleted: (pred_1 obj_05)
   added: (pred_5 obj_05 obj_08) (pred_4)
   goals met: 2 of 2
